packages/apps/graph/src/tests/artillery-test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 20
      arrivalRate: 5
      name: Warmup
    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: Ramp up load
    - duration: 300
      arrivalRate: 25
      name: Load
  payload:
    - path: 'events.csv'
      fields:
        - 'event'
    - path: 'startHeights.csv'
      fields:
        - 'height'
scenarios:
  - name: 'Load and SSE'
    flow:
      - post:
          url: '/graphql'
          json:
            query: |-
              query BlocksFromRaffleStart($startHeight: Int!, $events: [String!]) {
                blocksFromHeight(startHeight: $startHeight, chainIds: [0]) {
                  chainid
                  height
                  hash
                  creationtime
                  transactions(first: 100, events: $events) {
                    edges {
                      node {
                        code
                      }
                    }
                  }
                }
              }
            variables:
              startHeight: "{{ height }}"
              events: ["{{ event }}", "{{ event }}"]
            operationName: BlocksFromRaffleStart
            extensions: {}
          capture:
            - json: "$.data.blocksFromHeight[302].hash"
              as: "hash"
      - think: 15
      - post:
          url: '/graphql'
          json:
            query: |-
              query nodes($hash: String!) {
                node(
                  id: $hash
                ) {
                  id
                  ... on Transaction {
                    reqKey
                    block {
                      chainid
                      hash
                    }
                  }
                }
              }
            variables:
              hash: "{{ hash }}"
            operationName: Nodes
            extensions: {}
          capture:
            - json: "$.data.node.block.hash"
              as: "secondHash"